In [1]:
import numpy as np, pandas as pd

创建DataFrame的方式

In [3]:
#通过字典，键为列标签（表头），值为一个同质数据列表或元组
dt = {'country':['China','Japan','America','India'],
      'population':[13.9, 1.5, 3.5, 15],
      'GDP':[14, 12, 23, 5]
}

In [4]:
df = pd.DataFrame(dt)
df

   country  population  GDP
0    China        13.9   14
1    Japan         1.5   12
2  America         3.5   23
3    India        15.0    5

In [5]:
df['offical language'] = ['Chinese', 'Japanese', 'English', 'English and Hindu']
df

   country  population  GDP   offical language
0    China        13.9   14            Chinese
1    Japan         1.5   12           Japanese
2  America         3.5   23            English
3    India        15.0    5  English and Hindu

In [7]:
df['rank'] = np.arange(4,8)
df

   country  population  GDP   offical language  rank
0    China        13.9   14            Chinese     4
1    Japan         1.5   12           Japanese     5
2  America         3.5   23            English     6
3    India        15.0    5  English and Hindu     7

In [12]:
ar = np.random.randn(5,8)

In [25]:
dtar = pd.DataFrame(ar,index=('aa','bb','cc','dd','ff'),columns = ['a','b','c','d','e','f','g','h'])
dtar

,a,b,c,d,e,f,g,h
aa,-1.362408,-0.755777,1.916718,-1.284639,0.282454,-0.879755,-0.135912,-1.535116
bb,0.114359,-0.581786,-1.308700,0.059620,0.077673,1.192024,-0.209221,1.287825
cc,-2.558848,-0.146093,-0.089873,1.256949,-0.066722,-0.185898,0.172740,1.316773
dd,-0.598124,-0.442124,1.140368,0.183679,-0.621849,0.270886,1.135977,-1.206117
ff,-1.376248,1.161713,0.768086,0.593099,-0.389462,0.936019,2.276847,0.332538

In [22]:
dtar.columns = ['a','b','c','d','e','f','g','h']
dtar

,a,b,c,d,e,f,g,h
0,-1.362408,-0.755777,1.916718,-1.284639,0.282454,-0.879755,-0.135912,-1.535116
1,0.114359,-0.581786,-1.308700,0.059620,0.077673,1.192024,-0.209221,1.287825
2,-2.558848,-0.146093,-0.089873,1.256949,-0.066722,-0.185898,0.172740,1.316773
3,-0.598124,-0.442124,1.140368,0.183679,-0.621849,0.270886,1.135977,-1.206117
4,-1.376248,1.161713,0.768086,0.593099,-0.389462,0.936019,2.276847,0.332538

#字典列表

In [26]:
lt = [{'x':12,'y':22},{'x':55,'y':88}]
dtlt=pd.DataFrame(lt,index=['s1','s2'])
dtlt

     x   y
s1  12  22
s2  55  88

In [27]:
df2 = pd.DataFrame.from_dict(dt)
df2

   country  population  GDP
0    China        13.9   14
1    Japan         1.5   12
2  America         3.5   23
3    India        15.0    5

In [28]:
records = [('china','india','japan'),(13,14,2)]
df3 = pd.DataFrame.from_records(records)
df3

       0      1      2
0  china  india  japan
1     13     14      2

In [29]:
type(df2['country'])

pandas.core.series.Series

In [30]:
df2['country'].index

RangeIndex(start=0, stop=4, step=1)

In [31]:
df2['country']

0      China
1      Japan
2    America
3      India
Name: country, dtype: object

In [32]:
df2['country'].name

'country'